Repository: 84000/data-translation-memory
Catalog: toh232-v4.tmx
Source language: bo
Languages: en

source: དགའ་བས་རྩེ་བ་དང་བཅས་པ་ཡང་དག་པར་སྦས་པ་སྟོན་པའི་སྟོབས་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called engaging in the strength of revealing the correct concealment associated with the play of joy.

source: བཏང་སྙོམས་ཀྱིས་རྩེ་བ་དང་བཅས་པ་ཡང་དག་པར་སྦས་པས་སྟོན་པའི་སྟོབས་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་སྟེ།
en: There is the Dharma gateway called engaging in the strength of revealing the correct concealment associated with the play of equanimity.

source: བཅུ་པོ་དེ་དག་ནི་རྩེ་བ་དང་བཅས་པ་ཡང་དག་པར་སྦས་པ་སྟོན་པའི་དཔུང་བསྐྱེད་པ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ཡིན་ནོ།
en: These ten are the Dharma gateways called engaging in marshalling the force that reveals the correct concealment associated with play.”

source: །དེ་ནས་དེའི་ཚེ་ལྷའི་བུ་བློ་གྲོས་རྒྱ་མཚོ་ཞེས་བྱ་བས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་ནས་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །རྟག་པའི་ལྗོན་པ་སློབ་མའི་ས་ཡི་ས་ནི་བསྟེན་གྱུར་ཅིང་། །བྱང་ཆུབ་ཡན་ལག་མེ་ཏོག་རྟག་ཏུ་ཞི་བའི་རྩ། །བསམ་གཏན་མྱུ་གུ་ཡལ་ག་འབྲས་བུར་ལྡན་པ་པོ། །རྫུ་འཕྲུལ་ལོ་མ་ཤིང་རྟ་ཁྱོད་ལ་མགོ་བོས་གཏུག །
en: At that time, a devaputra named Oceanic Intellect made offerings to the Bhagavān and uttered this verse: “I bow my head to you, charioteer— A tree of permanence tended by the ground of disciples, With branches of awakening, roots of everlasting tranquility, Sprouts of concentration, fruit-bearing boughs, and leaves of miraculous powers.”

source: རྩེ་བ་དང་བཅས་པ་ཡང་དག་པར་སྦས་པ་སྟོན་པའི་དཔུང་བསྐྱེད་པ་ལ་འཇུག་པའི་གླེང་གཞིའི་ལེའུ་ཞེས་བྱ་སྟེ་སུམ་ཅུ་གཅིག་པའོ།། །།
en: This concludes the thirty-first chapter, on the topic of engaging in marshalling the force that reveals the correct concealment associated with play.

source: སྤྲིན་ཆེན་སྙིང་པོས་གསོལ་པ། ཡེ་ཤེས་རྩོམ་པའི་ཆོ་ག་ལ་ཞུགས་པའི་རྣམ་པ་ཞེས་བགྱི་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ།
en: Great Cloud Essence said, “I beseech the Bhagavān to explain the ten Dharma gateways called the aspects of engaging in procedures for engendering gnosis.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དམིགས་པ་ལ་མངོན་པར་བརྐམ་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: The Bhagavān replied, “There is the Dharma gateway called craving for sense objects.

source: རྒྱན་གྱི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called king of adornment.

source: སྟོབས་འབྲི་བར་བྱ་བ་ལ་མངོན་པར་དགའ་བ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called delighting in causing the diminishment of strength.

source: མཁས་པའི་ལུས་མི་ཟད་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called inexhaustible skillful body.

source: རྩེ་བ་ལ་མངོན་པར་ཆགས་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called attachment to play.

source: སྦྱིན་པ་དང་རིམ་གྲོའི་བྱ་བ་བྱེད་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called performing the activities of offering and worship.

source: ཐང་ལ་མངོན་པར་དགའ་བའི་སྦྱོར་བ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called practice of delighting in the earth.

source: སྦྱོར་བའི་མཚམས་ལ་མངོན་པར་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called entering into the place of rebirth.

source: དགའ་བའི་དུས་ཚོད་ཀྱི་སྦྱོར་བ་ལ་གནས་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called abiding in the practice of the time of joy.

source: གཞུང་ལུགས་མངོན་པའི་གནས་ལ་གནས་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་སྟེ།
en: There is the Dharma gateway called abiding in the abode of the scriptural tradition.

source: བཅུ་པོ་དེ་དག་ནི་ཡེ་ཤེས་རྩོམ་པའི་ཆོ་ག་ལ་ཞུགས་པའི་རྣམ་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ཡིན་ནོ།
en: These ten are the Dharma gateways called the aspects of engaging in procedures for engendering gnosis.”

source: །དེ་ནས་དེའི་ཚེ་ལྷ་མོ་སྣ་མའི་མེ་ཏོག་ལ་མངོན་པར་དགའ་བ་ཞེས་བྱ་བས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་ནས་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །དཔའ་ཆེན་ཡེ་ཤེས་རྩོམ་པ་པོ། །ཡང་དག་རྩོམ་ལ་རབ་སྦྱོར་བ། །སེམས་ཅན་རྣམས་ལ་ཕན་བཞེད་པ། །ཆོས་རྣམས་སྣ་ཚོགས་སྟོན་པ་མཛད།
en: At that time, a goddess named Manifest Delight in the Nutmeg Flower made offerings to the Bhagavān and uttered this verse: “Great hero who engenders gnosis, Utterly engaged in the correct undertaking, You teach these various doctrines With the wish to benefit sentient beings.”

source: །ཡེ་ཤེས་རྩོམ་པའི་ཆོ་ག་ལ་ཞུགས་པའི་རྣམ་པའི་གླེང་གཞིའི་ལེའུ་ཞེས་བྱ་སྟེ་སུམ་ཅུ་གཉིས་པའོ།། །།
en: This concludes the thirty-second chapter, on the aspects of engaging in procedures for engendering gnosis.

source: སྤྲིན་ཆེན་སྙིང་པོས་གསོལ་པ། ཡེ་ཤེས་ཀྱི་ནོར་བསྒྲིམས་ཏེ་བསྒྲུབ་པའི་མཛོད་ཅེས་བགྱི་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ།
en: Great Cloud Essence asked, “I beseech the Bhagavān to explain the ten Dharma gateways called storehouse of the riches of gnosis attained through concentration.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ལེགས་པའི་ནན་ཏན་གྱི་སྦྱོར་བ་ལ་མཁས་པའི་རིན་པོ་ཆེ་བསྒྲུབ་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: The Bhagavān replied, “There is the Dharma gateway called accomplishment of the precious skill of the earnest practice of excellence.

source: དམ་པའི་ཆོས་ལ་ཤིན་ཏུ་གུས་པར་བསྒྲིམས་པའི་སེམས་ལ་གནས་པར་སྦྱོར་བ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called practice of abiding in the mind concentrated on extreme faith in the sacred Dharma.

source: བདེན་པའི་དུས་ཚོད་ཀྱི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called king of the time of truth.

source: ཡང་དག་པར་ཟབ་ཅིང་བརྟན་པ་ལ་རྩེ་བ་དང་བཅས་པའི་རྒྱ་མཚོའི་རིན་པོ་ཆེའི་རྫས་བསྒྲུབ་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called accomplishment of the precious substances of the ocean having the play of correct depth and stability.

source: མངོན་པར་དགའ་བ་བསྒྲུབ་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called accomplishment of joy.

source: ཡེ་ཤེས་ཀྱི་སྟོབས་རབ་ཏུ་བསྒྲུབ་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called utter accomplishment of the strength of gnosis.

source: མངོན་པར་རྒྱུ་བ་བསྒྲུབ་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called accomplishment of motion.

source: མངོན་པར་འདོད་པར་བྱ་བའི་ཡོན་ཏན་བསྒྲུབ་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called accomplishment of the qualities of engaging in desire.

source: ལུས་ལ་སྦྱོར་བ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called training the body.

source: མཁས་པ་དང་། གཙང་སྦྲ་དང་། ངེས་པ་དང་། བརྟུལ་ཞུགས་དང་། ཉེ་བར་གནས་པ་ལ་བསྒྲིམས་ཏེ་བསྒྲུབ་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་སྟེ།
en: There is the Dharma gateway called accomplishment of concentration on knowledge, purity, certainty, ascetic practice, and observing precepts.

source: བཅུ་པོ་དེ་དག་ནི་ཡེ་ཤེས་ཀྱི་ནོར་བསྒྲིམས་ཏེ་བསྒྲུབ་པའི་མཛོད་ཅེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ཡིན་ནོ།
en: These ten are the Dharma gateways called storehouse of the riches of gnosis that are attained through concentration.”

source: །དེ་ནས་དེའི་ཚེ་ལྷ་མོ་ཕྲེང་བ་སྣ་ཚོགས་ཅན་ཞེས་བྱ་བས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་ནས་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །གསང་བའི་འབྱུང་གནས་བསམ་གཏན་ཞི་བའི་ཡན་ལག་གི། །ཅོད་པན་རྣམ་གྲོལ་ཆུ་དང་དྲན་པ་བསིལ་བའི་རླབས། །བདག་ཉིད་རྟག་ཟབ་ཞི་བའི་བདག་ཉིད་ཆེ་བ་སྟེ། །རྒྱ་མཚོའི་ཚུལ་འདྲ་ཁྱོད་ལ་མགོ་བོས་གཏུག་པར་བགྱི།
en: At that time, a goddess named Possessing Various Garlands made offerings to the Bhagavān and uttered this verse: “You are the source of secrets, wearing the crown of the limbs of tranquil concentration, The water of liberation, and the cooling waves of mindfulness, The great being whose nature is permanent, profound, and tranquil— May I touch my head to you, who are like an ocean.”

source: །ཡེ་ཤེས་ཀྱི་ནོར་བསྒྲིམས་ཏེ་བསྒྲུབ་པའི་མཛོད་ཀྱི་གླེང་གཞིའི་ལེའུ་ཞེས་བྱ་སྟེ་སུམ་ཅུ་གསུམ་པའོ།། །།
en: This concludes the thirty-third chapter, on the storehouse of the riches of gnosis attained through concentration.

source: སྤྲིན་ཆེན་སྙིང་པོས་གསོལ་པ། ཡང་དག་པའི་མཆོད་སྦྱིན་ལ་ཕན་པའི་ཆོ་ག་བཀོད་པ་ཞེས་བགྱི་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ།
en: Great Cloud Essence said, “I beseech the Bhagavān to explain the ten Dharma gateways called array of procedures conducive to correctly offering and giving.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ངེས་པར་བསྡམས་པའི་ཆོ་ག་བརྟག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: The Bhagavān replied, “There is the Dharma gateway called understanding the rites of restraint.

source: མཆོད་སྦྱིན་ལ་ཕན་པའི་རིན་པོ་ཆེའི་ཆོ་གས་བསྲུངས་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called observing the precious rites that assist in offering and giving.

source: གཙང་སྦྲ་བསྲུང་བའི་དུས་ཚོད་ཅེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called time of guarding purity.

source: གཙང་སྦྲ་ལ་མངོན་པར་དགའ་བ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called delighting in purity.

source: སྦྱིན་པའི་ལོངས་སྤྱོད་སྦྱིན་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called giving the enjoyments of giving.

source: མིག་རབ་ཏུ་སྦྱིན་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called utterly giving one’s eyes.

source: ཟབ་མོ་གསང་བ་སྟོན་ཅིང་འཆད་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called revealing and explaining the profound secrets.

source: ཟབ་མོའི་ཆོས་ལ་གཅེས་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called cherishing the profound Dharma.

source: དེ་ཁོ་ནའི་སྙིང་པོ་ལ་གནས་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called abiding in the essence of reality.

source: གཞུང་ལུགས་ཐམས་ཅད་སྟོན་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་སྟེ།
en: There is the Dharma gateway called revealing all scriptural traditions.

source: བཅུ་པོ་དེ་དག་ནི་ཡང་དག་པའི་མཆོད་སྦྱིན་ལ་ཕན་པའི་ཆོ་ག་བཀོད་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ཡིན་ནོ།
en: These are the ten Dharma gateways called array of procedures conducive to correctly offering and giving.”

source: །དེ་ནས་དེའི་ཚེ་ལྷ་མོ་ཆོས་ལ་མངོན་པར་དགའ་བ་ཞེས་བྱ་བས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་ནས་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །དཔའ་ཆེན་ཆོས་ཀྱི་མཆོད་སྦྱིན་ཅན། །སྦྱིན་པའི་ཚོགས་ལྡན་དེ་བཞིན་གཤེགས། །སེམས་ཅན་རྣམས་ལ་སྨན་སླད་དུ། །མཆོད་སྦྱིན་སྣ་ཚོགས་སྟོན་པ་མཛད།
en: At that time, a goddess named Delights in Dharma made offerings to the Bhagavān and uttered this verse: “Great hero possessing the gift of Dharma, Tathāgata endowed with the accumulation of generosity, You display these various offerings and gifts To serve as medicine for all sentient beings.”

source: །ཡང་དག་པའི་མཆོད་སྦྱིན་ལ་ཕན་པའི་ཆོ་ག་བཀོད་པའི་གླེང་གཞིའི་ལེའུ་ཞེས་བྱ་སྟེ་སུམ་ཅུ་བཞི་པའོ།། །།
en: This concludes the thirty-fourth chapter, on the array of procedures conducive to correctly offering and giving.

source: སྤྲིན་ཆེན་སྙིང་པོས་གསོལ་པ། སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡང་དག་པའི་ས་བོན་རབ་ཏུ་སྐྱེད་པ་ཞེས་བགྱི་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ།
en: Great Cloud Essence said, “I beseech the Bhagavān to explain the ten Dharma gateways called full production of the correct seed of the buddhafield.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིན་པོ་ཆེའི་འབྱུང་གནས་ཀྱི་རྣམ་པར་རྒྱལ་བ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: The Bhagavān replied, “There is the Dharma gateway called victory of the jewel mine.

source: རིན་པོ་ཆེའི་འབྱུང་གནས་ཀྱི་ནོར་གྱི་ཆར་འབེབས་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called shower of jewels from the jewel mine.

source: རིན་པོ་ཆེའི་འབྱུང་གནས་ཀྱི་བསོད་ནམས་ཀྱི་མཛོད་ཅེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called storehouse of merit of the jewel mine.

source: རིན་པོ་ཆེའི་འབྱུང་གནས་ཀྱི་ཡང་དག་པའི་སྙིང་པོའི་བློ་གྲོས་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called intellect of the true essence of the jewel mine.

source: རིན་པོ་ཆེའི་འབྱུང་གནས་ཀྱི་ལུས་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called body of the jewel mine.

source: རིན་པོ་ཆེའི་འབྱུང་གནས་ཀྱི་འོད་འཕྲོ་བཟང་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called excellent radiant light of the jewel mine.

source: རིན་པོ་ཆེའི་འབྱུང་གནས་ཀྱི་སྒྲོན་མའི་འོད་འཕྲོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called radiant light of the lamp of the jewel mine.

source: རིན་པོ་ཆེའི་འབྱུང་གནས་ཀྱི་གློག་གི་འོད་ཀྱི་བློ་གྲོས་མི་ཟད་པའི་ཅོད་པན་གྱི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called king crowned with the inexhaustible intellect of the lightning of the jewel mine.

source: རིན་པོ་ཆེའི་འབྱུང་གནས་ལ་གནས་པའི་གཙང་སྦྲ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called purity of abiding in the jewel mine.

source: རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་ཞིང་གི་འབྲས་བུའི་རོའི་ཕུང་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་སྟེ།
en: There is the Dharma gateway called mass of flavors of the fruits from the field of all jewels.

source: བཅུ་པོ་དེ་དག་ནི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡང་དག་པའི་ས་བོན་རབ་ཏུ་སྐྱེད་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ཡིན་ནོ།
en: These ten are the Dharma gateways called full production of the correct seed of the buddhafield.”

source: །དེ་ནས་དེའི་ཚེ་ལྷ་མོ་རིན་ཆེན་ཆར་འབེབས་ཞེས་བྱ་བས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་ནས་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །བཅོམ་ལྡན་སངས་རྒྱས་བསོད་ནམས་ཞིང་། །འཇིག་རྟེན་ཀུན་ལ་ཐུགས་བརྩེ་ཞིང་། །སེམས་ཅན་རྣམས་ལ་སྨན་སླད་དུ། །ཞིང་རྣམས་སྣ་ཚོགས་སྟོན་པ་མཛད།
en: At that time, a goddess named Shower of Jewels made offerings to the Bhagavān and uttered this verse: “Bhagavān Buddha, you are a field of merit, A field of compassion for all worlds. You reveal these various fields To serve as medicine for all sentient beings.”

source: །སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡང་དག་པའི་ས་བོན་རབ་ཏུ་སྐྱེད་པའི་གླེང་གཞིའི་ལེའུ་ཞེས་བྱ་སྟེ་སུམ་ཅུ་ལྔ་པའོ།། །།
en: This concludes the thirty-fifth chapter, on the full production of the correct seed of the buddhafield.

source: སྤྲིན་ཆེན་སྙིང་པོས་གསོལ་པ། དེ་ཁོ་ནའི་སྙིང་པོའི་ཚུལ་གྱིས་མངོན་པར་རྩེ་བ་ལ་དགའ་བའི་རྒྱལ་པོའི་རྣམ་པར་འཕྲུལ་པ་ལ་འཇུག་པ་ཞེས་བགྱི་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ།
en: Great Cloud Essence said, “I beseech the Bhagavān to explain the ten Dharma gateways called engaging in the magical manifestation of the king of delighting in the playof the state of the essence of reality.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། མི་གཡོ་བར་དགའ་བ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: The Bhagavān replied, “There is the Dharma gateway called engaging in unwavering joy.

source: རྩ་བ་བརྟན་པ་ལ་གནས་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called abiding by the constant root.

source: མི་བསྐྱོད་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called unmoving.

source: ཟབ་མོ་ལ་རབ་ཏུ་གནས་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called dwelling in profundity.

source: བསམ་གྱིས་མི་ཁྱབ་པའི་མཛོད་ཀྱི་རྣམ་པར་ཐར་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called complete liberation of the inconceivable storehouse.

source: ཡིད་དུ་འོང་བས་རྒྱས་པའི་བློ་གྲོས་ཀྱི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called king of the intellect that has flourished through pleasure.

source: མི་གནས་མི་ཟད་པའི་བློ་གྲོས་ཀྱི་སྟོབས་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called strength of the inexhaustible nonabiding intellect.

source: བསམ་གྱིས་མི་ཁྱབ་པའི་ཚུལ་གྱི་མཐའ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called culmination of the inconceivable manner.

source: ཡེ་ཤེས་ཀྱི་ཕྱག་རྒྱའི་མཐའ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called culmination of the seal of gnosis.

source: རྒྱ་མཚོ་མི་ཟད་པ་ཐམས་ཅད་ཀྱི་བློ་གྲོས་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་སྟེ།
en: There is the Dharma gateway called king of intellect of all inexhaustible oceans.

source: སྤྲིན་ཆེན་སྙིང་པོ་བཅུ་པོ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དེ་ཁོ་ནའི་སྙིང་པོའི་ཚུལ་གྱིས་མངོན་པར་རྩེ་བ་ལ་དགའ་བའི་རྒྱལ་པོའི་རྣམ་པར་འཕྲུལ་པ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ཡིན་ནོ།
en: Great Cloud Essence, these ten are the Dharma gateways called engaging in the magical manifestation of the king of delighting in the play that manifests through the manner of the essence of reality of the tathāgatas and bodhisattvas.”

source: །དེ་ནས་དེའི་ཚེ་ལྷའི་བུ་སྐར་འོད་ཅེས་བྱ་བས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་ཆེན་པོའི་ལས་བྱས་ནས་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ།
en: At that time, a devaputra named Starlight made great offerings to the Bhagavān and uttered this verse:

source: །ཀྱེ་མ་བཅོམ་ལྡན་སངས་རྒྱས་བསམ་མི་ཁྱབ། །དེ་བཞིན་གཤེགས་པ་བསམ་གྱིས་མི་ཁྱབ་སྐུ། །སེམས་ཅན་རྣམས་ལ་ཕན་པ་མཛད་སླད་དུ། །བསམ་གྱིས་མི་ཁྱབ་བསམ་ཡས་མདོ་ཡང་སྟོན།
en: “Ah! Inconceivable bhagavān Buddha, With the inconceivable body of a tathāgata, You have revealed this inconceivable discourse To benefit all sentient beings.”

source: །དེ་ཁོ་ནའི་སྙིང་པོའི་ཚུལ་གྱིས་མངོན་པར་རྩེ་བ་ལ་དགའ་བའི་རྒྱལ་པོའི་རྣམ་པར་འཕྲུལ་པ་ལ་འཇུག་པའི་གླེང་གཞིའི་ལེའུ་ཞེས་བྱ་སྟེ་སུམ་ཅུ་དྲུག་པའོ།། །།
en: This concludes the thirty-sixth chapter, on engaging in the magical manifestation of the king of delighting in the play of the state of the essence of reality.

source: དེ་ནས་དེའི་ཚེ་ལྷའི་བུ་བློ་གྲོས་མྱུར་ལྡན་ཞེས་བྱ་བས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་ཆེན་པོའི་ལས་བྱས་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ།
en: At that time, a devaputra named Swift Intellect made great offerings to the Bhagavān and went before the Bhagavān, joined his palms, and bowed in homage.

source: ཏ་ལ་བདུན་སྲིད་ཙམ་དུ་བར་སྣང་ལ་འདུག་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས། མདོ་སྡེ་དག་ལ་དུ་ཞིག་མཆིས།
en: He then soared into the air, reaching a height equal to that of seven palm trees, and addressed the Bhagavān: “Bhagavān, how many discourses are there?

source: །ཏིང་འཛིན་རྣམས་ཀྱང་དུ་ཞིག་མཆིས།
en: How many samādhis are there?

source: །གཟུངས་ཀྱི་ལམ་དག་དུ་ཞིག་མཆིས།
en: How many avenues of dhāraṇī are there?

source: །གསང་ལ་འཇུག་པ་དུ་ཞིག་མཆིས།
en: How many secrets can be entered? “

source: །བཅོམ་ལྡན་འདས། ད་ལྟར་བཞུགས་པའི་སངས་རྒྱས་དུ།
en: Bhagavān, how many buddhas abide in the present?

source: །མ་བྱོན་པ་ནི་དུ་ཞིག་བཞུགས།
en: How many will come in the future?

source: །འདས་པའི་སངས་རྒྱས་དུ་ཙམ་ཞིག །
en: How many buddhas have existed in the past?

source: སངས་རྒྱས་སྤྱོད་ཡུལ་ཇི་སྙེད་མཆིས།
en: How great is the domain of the Buddha’s activity?

source: །འཇིག་རྟེན་ཁམས་ནི་དུ་ཞིག་མཆིས།
en: How many world realms are there?

source: །གསུང་བར་འཚལ་ལོ་གཽ་ཏ་མ།
en: Please speak, O Gautama! “

source: །སེམས་ཅན་ཀུན་གྱི་མཆོག་གྱུར་པ། །གཽ་ཏ་མ་ལ་བདག་ཞུ་ན། །སེམས་ཅན་ཀུན་ལ་སྨན་སླད་དུ། །རྐང་གཉིས་གཙོ་བོས་བཤད་དུ་གསོལ།
en: The most supreme among sentient beings, Gautama, I ask you: Please give an explanation, chief of two-legged beings, To serve as medicine for all sentient beings.”

source: །དེ་ནས་སངས་རྒྱས་ཀྱི་མཐུས་ལྷའི་བུ་བློ་གྲོས་མི་ཟད་པའི་སྙིང་པོ་ཞེས་བྱ་བས་བློ་གྲོས་མྱུར་ལྡན་ཞེས་བྱ་བ་ལ་ཚིགས་སུ་བཅད་དེ་སླར་སྨྲས་པ། ཚངས་པ་ཆེན་པོ་ལེགས་སོ་ལེགས།
en: Then, through the Buddha’s power, a devaputra named Essence of Inexhaustible Intellect replied to Swift Intellect with these verses: “Excellent, excellent, great brahmin!

source: །སེམས་ཅན་ཀུན་ལ་ཕན་པའི་ཕྱིར། །ཞུ་བའི་རྒྱལ་པོ་ལེགས་པར་ཞུས། །འཇིགས་མེད་འདི་ནི་རིགས་པ་ཡིན།
en: For the benefit of all sentient beings, You have eloquently asked these kingly questions With a fearlessness that is appropriate. “

source: །དྲིས་པའི་དོན་ནི་རིམ་བཞིན་དུ། །མིག་ཡངས་རབ་ཏུ་བཤད་པར་བྱས།
en: The answers to your questions will, one by one, Be openly and thoroughly explained.

source: །གཡེང་བ་མེད་པའི་སེམས་ཀྱིས་སུ། །ཚངས་ཆེན་ཁྱོད་ཀྱིས་མཉན་པར་གྱིས།
en: Listen carefully, great brahmin, With an undistracted mind. “

source: །མདོ་སྡེ་རྣམས་ནི་རེ་རེ་ལ། །གང་གཱའི་ཀླུང་གི་བྱེ་སྙེད་ཀྱི། །བསྒྱུར་བའི་དོན་ནི་མང་ཡོད་ཅེས། །ཆོས་གསུང་བས་ན་ངེས་པར་བསྟན།
en: The meanings contained in the discourses Are said to be as numerous As the grains of sand in the Ganges River; So has it been revealed in the teachings of Dharma. “

source: །གཟུངས་ཀྱི་འབབ་ཆུའི་མིང་རྣམས་ཀྱང་། །རེ་རེ་ནས་ནི་རབ་དབྱེ་ན། །དོན་མང་དྲི་བ་མང་ཡོད་ཅེས། །ཆོས་གསུང་བས་ནི་ངེས་པར་བསྟན།
en: Even the names of the cascade of dhāraṇīs, When analyzed one by one, Are said to contain many meanings and many questions; So has it been revealed in the teachings of Dharma. “

source: །ཏིང་འཛིན་འབབ་ཆུའི་མིང་རྣམས་ཀྱང་། །རེ་རེ་ནས་ནི་རབ་དབྱེ་ན། །དོན་མང་དྲི་བ་མང་ཡོད་ཅེས། །ཆོས་གསུང་བས་ནི་ངེས་པར་བསྟན། །
en: Even the names of the cascade of samādhis, When analyzed one by one, Are said to contain many meanings and many questions; So has it been revealed in the teachings of Dharma. “

source: ཀུན་དགའ་བོ་དང་འདྲ་བའི་མི། །དཀྲིགས་ཕྲག་བྱེ་བ་སྙེད་ཡོད་ལ། །མདོ་ལས་གཅིག་གི་ཚད་གཟུང་ཕྱིར། །སྐྱེས་བུ་དམ་པ་བྱུང་གྱུར་ཏེ། །སྐྱེས་བུ་དམ་པ་དེ་ཀུན་ལས། །སྐྱེས་བུ་སྐྱེས་མཆོག་རེ་རེ་ཡང་། །ལྷ་ཡི་ལོ་མང་བྱེ་བརྒྱར་ཐུབ། །སྐྱེས་བུ་བརྟན་པོ་རེ་རེ་ཡང་། །གང་གཱའི་བྱེ་མ་ཇི་ཙམ་པར། །རང་རང་གི་ནི་ལྕེ་ཚོགས་རྣམས། །མདོ་སྡེ་དག་གི་མིང་གི་ཕྱིར། །བྱིན་གྱིས་བརླབ་པར་བྱས་པ་དང་། །དེ་དག་གི་ནི་ཐབས་ཚུལ་གྱིས། །སྐྱེས་བུ་སྐྱེས་མཆོག་དེ་དག་གིས། །མདོ་སྡེ་རྣམས་ནི་རེ་རེ་ཡི། །མིང་ཙམ་དག་ཀྱང་བསླབ་པའི་ཕྱིར། །ལོ་མང་བྱེ་བ་བརྒྱ་པ་ཡི། །སྐྱེས་བུ་དེ་འདྲ་དེ་ཀུན་གྱིས། །འབབ་ཆུ་འདྲ་བའི་མིང་བཟུང་ཡང་། །ཐ་མར་ཕྱིན་པར་མི་ནུས་ཏེ།
en: If there was a throng of billions upon billions of people, All of them like Ānanda, Who became holy persons In order to fathom just one among the discourses, “And each of the beings of highest birth Among all those holy persons Became a supreme being Capable of living for ten billion years, the long lives of gods, And if those individual steadfast persons “Collectively had as many tongues As there are grains of sand in the Ganges River That were blessed for the sake of learning the names of these discourses, “And then, through this method, Those supreme beings Trained in learning only the names Of each of the many discourses, “Then even beings such as these Who could live for ten billion years Would be unable to completely recollect These names, which are like a waterfall. “

source: །བཅོམ་ལྡན་མདོ་ནི་བསམ་མི་ཁྱབ།
en: The discourses of the Bhagavān are inconceivable.

source: །ཏིང་འཛིན་གྲངས་ཀྱང་དེ་བཞིན་ཏེ།
en: So are the enumerations of samādhis.

source: །གསང་བ་བཤད་པ་བསམ་མི་ཁྱབ།
en: The explanations of secrets are inconceivable.

source: །སངས་རྒྱས་བསམ་ཡས་བསམ་མི་ཁྱབ།
en: The infinite buddhas are inconceivable.

source: །དེ་བཞིན་གཤེགས་པ་དཔག་ཏུ་མེད།
en: The Tathāgata is unfathomable.

source: །སངས་རྒྱས་སྤྱོད་ཡུལ་བསམ་མི་ཁྱབ། །མཚུངས་པ་མེད་ཅིང་ཤིན་ཏུ་འདས།
en: The domain of the Buddha’s activity is inconceivable, Unparalleled, and totally transcendent. “

source: །འདས་པ་དག་ཀྱང་དཔག་ཏུ་མེད།
en: The buddhas of the past are unparalleled.

source: །ད་ལྟར་བྱུང་བའང་བསམ་མི་ཁྱབ།
en: The buddhas of the present are inconceivable.

source: །མ་འོངས་པ་ཡང་བསམ་དུ་མེད།
en: The buddhas of the future are inconceivable.

source: །འཇིག་རྟེན་ཁམས་ནའང་བསམ་མི་ཁྱབ།
en: The world realms are inconceivable. “

source: །དཔེར་ན་སྨན་པ་བྱུང་གྱུར་ཅིང་། །མཁས་པ་ཞིག་གིས་ནད་རྟོགས་ནས། །ནད་པའི་ཉམས་ལས་དཔག་བྱས་ཏེ། །ཆོ་ག་རིམ་བཞིན་སྟོན་པ་དང་།
en: Consider, by analogy, a person who has become a doctor: Having understood health problems, That skilled person can diagnose an illness according to its symptoms And show the proper course of treatment. “

source: །དཔེར་ན་བུད་མེད་མཁས་མ་ཡིས། །རང་གི་བུ་ཡི་ཉམས་རིག་ནས། །སོར་མོའི་རྩེ་མོར་མར་བྱུགས་ཏེ། །ཇི་རན་ལྡག་ཏུ་བཅུག་པ་ལྟར།
en: Consider, by analogy, a skilled woman who, Discovering that her son is unwell, Spreads butter on the tips of her fingers And inserts them in his mouth to lick. “

source: །དེ་བཞིན་བཅོམ་ལྡན་སངས་རྒྱས་ཀྱང་། །འདུལ་བའི་ཉམས་དྲོད་མཁྱེན་ནས་ནི། །སེམས་ཅན་རྣམས་ཀྱིས་བཟོད་པ་ཡི། །མདོ་སྡེའི་ཚིག་དོན་སྟོན་པར་མཛད།
en: In this fashion, the bhagavān Buddha, Having understood the pathologies of the beings to be tamed, Has shown the topics of the discourses To be accepted by sentient beings.”

source: །དེ་ནས་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྲིན་ཆེན་སྙིང་པོས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་བསམ་གྱིས་མི་ཁྱབ་པའི་ཡང་བསམ་གྱིས་མི་ཁྱབ་པའི་ཡུལ་སྤྲིན་ཆེན་པོའི་མདོ། །སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་བརྩེ་བར་བགྱིད་པ་ལེགས་པར་གཟིགས་ནས་དེ་བཞིན་གཤེགས་པས་བཤད་པ་ནི་ཨ་ལ་ལ་ངོ་མཚར་ཏོ།
en: At that time, the bodhisattva mahāsattva Great Cloud Essence addressed the Bhagavān, saying, “Bhagavān, the Tathāgata, who excellently cares for all sentient beings with great compassion, has explained this Great Cloud discourse, which belongs to the inconceivably inconceivable domain of the tathāgatas.

source: །བཅོམ་ལྡན་འདས་ཏིང་ངེ་འཛིན་གྱི་སྒོ་བཞི་བརྒྱ་ཡང་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་རྒྱས་པར་བཤད་དུ་གསོལ།
en: Ah, how wondrous! Bhagavān, I beseech the bhagavān Tathāgata to extensively explain the four hundred samādhi gateways.”
